import { TransliterationMap } from './types';

export const HINDI_MAP: TransliterationMap = {
  halant: '्',
  vowels: {
    'a': 'अ', 'aa': 'आ', 'i': 'इ', 'ii': 'ई', 'ee': 'ई', 'u': 'उ', 'uu': 'ऊ', 'oo': 'ऊ',
    'e': 'ए', 'ai': 'ऐ', 'o': 'ओ', 'au': 'औ'
  },
  matras: {
    'a': '', 
    'aa': 'ा', 'i': 'ि', 'ii': 'ी', 'ee': 'ी', 'u': 'ु', 'uu': 'ू', 'oo': 'ू',
    'e': 'े', 'ai': 'ै', 'o': 'ो', 'au': 'ौ'
  },
  consonants: {
    'k': 'क', 'kh': 'ख', 'g': 'ग', 'gh': 'घ',
    'ch': 'च', 'chh': 'छ', 'j': 'ज', 'jh': 'झ',
    't': 'त', 'th': 'थ', 'd': 'द', 'dh': 'ध',
    'T': 'ट', 'Th': 'ठ', 'D': 'ड', 'Dh': 'ढ',
    'n': 'न', 'N': 'ण', 'p': 'प', 'ph': 'फ', 'f': 'फ़', 'b': 'ब', 'bh': 'भ', 'm': 'म',
    'y': 'य', 'r': 'र', 'l': 'ल', 'v': 'व', 'w': 'व', 'sh': 'श', 'S': 'ष', 's': 'स', 'h': 'ह'
  }
};