
import { TransliterationMap } from './types';

export const KANNADA_MAP: TransliterationMap = {
  halant: '್',
  vowels: {
    'a': 'ಅ', 'aa': 'ಆ', 'i': 'ಇ', 'ii': 'ಈ', 'u': 'ಉ', 'uu': 'ಊ', 
    'e': 'ಎ', 'ee': 'ಏ', 'ai': 'ಐ', 'o': 'ಒ', 'oo': 'ಓ', 'au': 'ಔ'
  },
  matras: {
    'a': '', 
    'aa': 'ಾ', 'i': 'ಿ', 'ii': 'ೀ', 'u': 'ು', 'uu': 'ೂ', 
    'e': 'ೆ', 'ee': 'ೇ', 'ai': 'ೈ', 'o': 'ೊ', 'oo': 'ೋ', 'au': 'ೌ'
  },
  consonants: {
    'k': 'ಕ', 'kh': 'ಖ', 'g': 'ಗ', 'gh': 'ಘ',
    'ch': 'ಚ', 'chh': 'ಛ', 'j': 'ಜ', 'jh': 'ಝ',
    't': 'ತ', 'th': 'ಥ', 'd': 'ದ', 'dh': 'ಧ',
    'T': 'ಟ', 'Th': 'ಠ', 'D': 'ಡ', 'Dh': 'ಢ',
    'n': 'ನ', 'N': 'ಣ', 'p': 'ಪ', 'ph': 'ಫ', 'b': 'ಬ', 'bh': 'ಭ', 'm': 'ಮ',
    'y': 'ಯ', 'r': 'ರ', 'l': 'ಲ', 'L': 'ಳ', 'v': 'ವ', 'w': 'ವ', 'sh': 'ಶ', 'S': 'ಷ', 's': 'ಸ', 'h': 'ಹ', 'x': 'ಕ್ಷ'
  }
};
